rotten-potatoes/app/views/reviews/index1.html.haml

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
            %tr
                %td= Movie.find(review.movie_id).title