rotten-potatoes/app/views/reviews/index.html.haml

SELECT  "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
            %tr
                %td= Moviegoer.find(review.moviegoer_id).name