rotten-potatoes/app/controllers/movies_controller.rb

    def main
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"

    def settings
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"

    def delete
        user_id = session[:user_id]
        Moviegoer.delete(user_id)
---
DELETE FROM "moviegoers" WHERE "moviegoers"."id" = ?  [["id", 51]]

    def deleteAll
        @movies = Movie.all
        @movies.each do |movie|
            movie.destroy
---
SELECT "movies".* FROM "movies"
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 4]]

    def searching
        name = params[:movie][:title]
        @movies = Movie.where(:title => name)
---
SELECT "movies"."title" FROM "movies" WHERE "movies"."title" = ?  [["title", "f"]]

    def show
        id = params[:id]
        if Movie.exists?(id)
            @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @movie = Movie.create!(params[:movie].permit(:title,:rating,:release_date))
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "CIAOOO"], ["rating", "NC-17"], ["release_date", "{1=>2020, 2=>4, 3=>4}"], ["created_at", "2020-04-04 13:08:38.916389"], ["updated_at", "2020-04-04 13:08:38.916389"]]

    def edit
        id = params[:id]
        @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
        id = params[:id]
        @movie = Movie.find(id)
        @movie.update_attributes!(params[:movie].permit(:title, :rating, :description, :release_date))
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "G"], ["release_date", "{1=>2020, 2=>4, 3=>4}"], ["updated_at", "2020-04-04 13:07:41.202263"], ["id", 1]]

	def destroy
		id = params[:id]
		@movie = Movie.find(id)
		@movie.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]