rotten-potatoes/app/controllers/sessions_controller.rb

def signing
        name = params[:user][:name]
        password = params[:user][:password]
        @users = Moviegoer.create(:name => name,:provider => password)
        if @users.name.length>0 && @users.provider.length>0
            redirect_to login_path
        else
            Moviegoer.delete(@users.id)
---
INSERT INTO "moviegoers" ("name", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["provider", ""], ["created_at", "2020-04-06 19:05:35.080937"], ["updated_at", "2020-04-06 19:05:35.080937"]]
DELETE FROM "moviegoers" WHERE "moviegoers"."id" = ?  [["id", 26]]

def create
    name = params[:user][:name]
    password = params[:user][:password]
    @users = Moviegoer.where(:name => name)
    @pass = Moviegoer.where(:provider => password)
    if @users.length==0 || @pass.length==0
        redirect_to login_path
    elsif Moviegoer.exists?(@users)
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."name" = ? AND "moviegoers"."uid" IS NULL  [["name", "guest"]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = ?  [["provider", ""]]
SELECT  1 AS one FROM "moviegoers" WHERE "moviegoers"."id" IN (SELECT "moviegoers"."id" FROM "moviegoers" WHERE "moviegoers"."name" = ?) LIMIT ?  [["name", "guest"], ["LIMIT", 1]]