app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("potatoes", "comments", "moviegoer_id", "movie_id") VALUES (?, ?, ?, ?)  [["potatoes", 3], ["comments", "ao"], ["moviegoer_id", 44], ["movie_id", 9]]
---
def create
    game_id = params[:game_id]
    user_id = session[:user_id]
    score = params[:review][:score]
    comments = params[:review][:comment]
    @user = User.find(user_id)
    @game = Game.find(game_id)
    @review = Review.new(:score => score,:comments => comments)
    @review.user_id = @user.id
    @review.game_id = @game.id
    @review.save!

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "potatoes" = ?, "comments" = ? WHERE "reviews"."id" = ?  [["potatoes", 3], ["comments", ""], ["id", 2]]
---
def update
    id = params[:id]
    game_id = params[:game_id]
    score = params[:review][:score]
    comments = params[:review][:comment]
    @reviews = Review.find(id)
    @reviews.update_attributes!(:score => score, :comments => comments)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]
---
def destroy
    id = params[:id]
    @reviews = Review.find(id)
    @reviews.destroy